/**
 * 请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
 * 数字 1-9 在每一行只能出现一次。
 * 数字 1-9 在每一列只能出现一次。
 * 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
 * 注意：
 * 一个有效的数独（部分已被填充）不一定是可解的。
 * 只需要根据以上规则，验证已经填入的数字是否有效即可。
 * 空白格用 '.' 表示。
 */

var isValidSudoku = function(board) {
    let col = Array.from({length:9}, () => new Set());
    let row = Array.from({length:9}, () => new Set());
    let box = Array.from({length:9}, () => new Set());

    for (let i=0; i<9; i++) {
        for (let j=0; j<9; j++) {
            let cur = board[i][j];
            if (cur !== '.') {
                if (col[i].has(cur)) {return false} else {col[i].add(cur);};
                if (row[j].has(cur)) {return false} else {row[j].add(cur);};
                let k = Math.floor(i/3)*3+Math.floor(j/3);
                if (box[k].has(cur)) {return false} else {box[k].add(cur);};
            };
        };
    };

    return true;
};

const board1 = 
[["5","3",".",".","7",".",".",".","."]
,["6",".",".","1","9","5",".",".","."]
,[".","9","8",".",".",".",".","6","."]
,["8",".",".",".","6",".",".",".","3"]
,["4",".",".","8",".","3",".",".","1"]
,["7",".",".",".","2",".",".",".","6"]
,[".","6",".",".",".",".","2","8","."]
,[".",".",".","4","1","9",".",".","5"]
,[".",".",".",".","8",".",".","7","9"]];
console.log(isValidSudoku(board1));
// 输出：true

const board2 = 
[["8","3",".",".","7",".",".",".","."]
,["6",".",".","1","9","5",".",".","."]
,[".","9","8",".",".",".",".","6","."]
,["8",".",".",".","6",".",".",".","3"]
,["4",".",".","8",".","3",".",".","1"]
,["7",".",".",".","2",".",".",".","6"]
,[".","6",".",".",".",".","2","8","."]
,[".",".",".","4","1","9",".",".","5"]
,[".",".",".",".","8",".",".","7","9"]]
console.log(isValidSudoku(board2));
// 输出：false